appetizr/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    @categories = Category.all

SELECT "categories".* FROM "categories" WHERE "categories"."nombre" = $1 LIMIT $2  [["nombre", "burger"], ["LIMIT", 1]]
---
  def show
    @category = Category.find(params[:nombre])

SELECT "categories".* FROM "categories" WHERE "categories"."nombre" = $1 LIMIT $2  [["nombre", "raft lolololoooo"], ["LIMIT", 1]]
---
  def edit
    @category = Category.find(params[:nombre])

SELECT "categories".* FROM "categories" WHERE "categories"."nombre" = $1 LIMIT $2  [["nombre", "raft lolololoooo"], ["LIMIT", 1]]
UPDATE "categories" SET "nombre" = $1, "updated_at" = $2 WHERE "categories"."nombre" = $3  [["nombre", "amitei"], ["updated_at", "2023-10-29 12:06:31.967545"], ["nombre", "raft lolololoooo"]]
---
  def update
    @category = Category.find(params[:nombre])
    if @category.update(category_params)