appetizr/app/controllers/dishes_controller.rb

  def update
    @dish = Dish.find(params[:id])
    if @dish.update(dish_params)
---
UPDATE "dishes" SET "nombre" = $1 WHERE "dishes"."id" = $2  [["nombre", "plato2updated"], ["id", 2]]