appetizr/app/controllers/dishes_controller.rb

  def show
    session[:review_referer] = nil
    @restaurant = Restaurant.find(params[:restaurant_id])
    alleged_dish = Dish.find_by(id: params[:id], restaurant_id: params[:restaurant_id])
    if alleged_dish
      @dish = alleged_dish
    else
      redirect_to request.referer
    end
    @reviews_reactions = get_comment_pack(@dish.reviews.find_each, 'reviews', 'Review', "AND reviewable_type='Dish' AND reviewable_id=#{@dish.id}")
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."reviewable_id" = $1 AND "reviews"."reviewable_type" = $2  [["reviewable_id", 4], ["reviewable_type", "Dish"]]

  def create
    nombre_imagen = subir_imagen(params.require(:dish)[:ruta_img_plato])
    @dish = Dish.new(dish_params.merge(ruta_img_plato: nombre_imagen, restaurant_id: session[:dish_restaurant]))
    if @dish.save
---
INSERT INTO "dishes" ("restaurant_id", "nombre", "rutaImgPlato", "descripcion", "precio") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["restaurant_id", 1], ["nombre", "hambre"], ["rutaImgPlato", "asdf"], ["descripcion", "asdf"], ["precio", 0.0]]

  def edit
    @dish = Dish.find(params[:id])
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @dish = Dish.find(params[:id])
    if params.require(:dish)[:ruta_img_plato].present?
      nombre_imagen = subir_imagen(params.require(:dish)[:ruta_img_plato])
      update_params = dish_params.merge(ruta_img_plato: nombre_imagen)
    else
      update_params = dish_params
    end
    if @dish.update(update_params)
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "dishes" SET "nombre" = $1 WHERE "dishes"."id" = $2  [["nombre", "plato2updated"], ["id", 2]]