appetizr/app/controllers/logins_controller.rb

  def create
    user = User.find_by(nombre: params[:nombre])
    if user.present? && user.authenticate(params[:password])
---
SELECT "users".* FROM "users" WHERE "users"."nombre" = $1 LIMIT $2  [["nombre", "Atreides"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."nombre" = $1 LIMIT $2  [["nombre", "gari"], ["LIMIT", 1]]