appetizr/app/controllers/post_responses_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def index
    @post = Post.find(params[:post_id])