appetizr/app/controllers/post_responses_controller.rb

  def index
    session[:response_referer] = nil
    @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]