appetizr/app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."nombre" = $1 LIMIT $2  [["nombre", "gari"], ["LIMIT", 1]]
INSERT INTO "posts" ("categoria", "autor", "contenido", "ruta_img", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    nombre_imagen = subir_imagen(params.require(:post)[:image])
    usuario = User.find_by(nombre: session[:username])
    # Cambiar en un futuro para que el usuario sea el post añada el campo de comentado por restaurante
    @post = Post.new(categoria: session[:post_category], autor: session[:username], contenido: params[:post][:content], ruta_img: nombre_imagen, created_at: Time.now, updated_at: Time.now)

    session[:post_category] = nil
    if @post.save