appetizr/app/controllers/reactions_controller.rb

  def create
    if !session[:username]
      redirect_to login_path
      return
    end
    reaction = Reaction.new(reaction_params)
    reaction.who = session[:username]
    puts reaction
    if reaction.valid? && reaction.save
---
INSERT INTO "reactions" ("who", "reactionable_type", "reactionable_id", "reaccion") VALUES ($1, $2, $3, $4) RETURNING "id"  [["who", "Atreides"], ["reactionable_type", "Review"], ["reactionable_id", 1], ["reaccion", "Like"]]

  def update
    if !session[:username]
      redirect_to login_path
      return
    end
    @reaction = Reaction.find_by(who: session[:username], reactionable_id: params[:reaction][:reactionable_id], reactionable_type: params[:reaction][:reactionable_type])
    if Reaction.update(@reaction.id, reaccion: params[:reaction][:reaccion])
---
SELECT "reactions".* FROM "reactions" WHERE "reactions"."who" = $1 AND "reactions"."reactionable_id" = $2 AND "reactions"."reactionable_type" = $3 LIMIT $4  [["who", "Atreides"], ["reactionable_id", 1], ["reactionable_type", "Review"], ["LIMIT", 1]]
UPDATE "reactions" SET "reaccion" = $1 WHERE "reactions"."id" = $2  [["reaccion", "Dislike"], ["id", 1]]