appetizr/app/controllers/registrations_controller.rb

INSERT INTO "users" ("nombre", "rutaImgPerfil", "esAdmin", "password_digest") VALUES ($1, $2, $3, $4)  [["nombre", "Atreides"], ["rutaImgPerfil", "default"], ["esAdmin", false], ["password_digest", "[FILTERED]"]]
---
  def create
    @user = User.new(nombre: params[:user][:nombre], password: params[:user][:password], rutaImgPerfil: "default", esAdmin: false)

    if @user.save