appetizr/app/controllers/restaurants_controller.rb

    def index
        @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

    def show
        @restaurant = Restaurant.find(params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def edit
        @restaurant = Restaurant.find(params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @restaurant = Restaurant.find(params[:id])
        if @restaurant.update(restaurant_params)
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "restaurants" SET "direccion" = $1 WHERE "restaurants"."id" = $2  [["direccion", "Calle 1233"], ["id", 1]]

    def destroy
        @restaurant = Restaurant.find(params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def search
        if params[:search]
            @restaurant = Restaurant.find_by(nombre: params[:search])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."nombre" = $1 LIMIT $2  [["nombre", "Goiko"], ["LIMIT", 1]]