appetizr/app/controllers/review_responses_controller.rb

  def index
    @review = Review.find(params[:review_id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]