appetizr/app/controllers/users_controller.rb

    def create
      nombre_imagen = subir_imagen(params.require(:user)[:ruta_img_perfil])
      @user = User.new(nombre: params[:user][:nombre], password: params[:user][:password], ruta_img_perfil: nombre_imagen, esAdmin: false, password_confirmation: params[:user][:password_confirmation])

      if @user.save
---
INSERT INTO "users" ("nombre", "rutaImgPerfil", "esAdmin", "password_digest") VALUES ($1, $2, $3, $4)  [["nombre", "tumama"], ["rutaImgPerfil", "default"], ["esAdmin", false], ["password_digest", "[FILTERED]"]]

    def show
        @user = User.find_by(nombre: session[:username])
---
SELECT "users".* FROM "users" WHERE "users"."nombre" = $1 LIMIT $2  [["nombre", "juan"], ["LIMIT", 1]]

    def update
      @user = User.find_by(nombre: session[:username])
---
SELECT "users".* FROM "users" WHERE "users"."nombre" = $1 LIMIT $2  [["nombre", "gari"], ["LIMIT", 1]]