appetizr/app/views/restaurants/edit_info.html.erb

SELECT "categories".* FROM "categories"
---
            <br>
            <%= collection_select(:nombre, :categoria, Category.all, :nombre, :nombre, {:selected => @restaurant.categoria}) %>