appetizr/app/views/restaurants/edit.html.erb

<ul>
  <% @restaurant.dishes.each do |dish| %>
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."restaurant_id" = $1  [["restaurant_id", 1]]