appetizr/app/views/restaurants/show.html.erb

    <div>
      <% @restaurant.dishes.each do |dish| %>
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."restaurant_id" = $1  [["restaurant_id", 2]]