appetizr/app/helpers/logins_helper.rb

      def current_user
        if session[:username]
          @current_user ||= User.find_by(nombre: session[:username])
---
SELECT "users".* FROM "users" WHERE "users"."nombre" = $1 LIMIT $2  [["nombre", "juan"], ["LIMIT", 1]]