appetizr/app/helpers/restaurants_helper.rb

SELECT "users".* FROM "users" WHERE "users"."nombre" = $1 LIMIT $2  [["nombre", "Atreides"], ["LIMIT", 1]]
---
  def get_rest_manager
    User.find_by(nombre: session[:username])